Week_6/W6D5/ninety-nine-cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "Ginger"], ["sex", "F"], ["description", "Grumpy cat."], ["updated_at", "2020-07-10 23:21:56.389664"], ["id", 8]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update(cat_params)